extras/taurus/tests/test.yml
#modules:
#  jmeter:
#    disable-plugins:
#      - aggregate-report
#      - view-results-tree
#      - view-results-in-table
#      - summary-report
#    java-opts:
#      - "-Djava.awt.headless=true"
#      - "-XX:-TieredCompilation"
#      - "-Xmx512m"

execution:
  - concurrency: 1
    name: "serial conc=1, 10ms, 1x80"
    scenario: serial_10ms_1x80
    ramp-up: 1s
    hold-for: 30s
    sequential: true
  - concurrency: 1
    name: "parallel conc=1, 10ms, 4x80"
    scenario: parallel_10ms_4x80
    ramp-up: 1s
    hold-for: 30s
    sequential: true
  - concurrency: 10
    name: "serial conc=10, 10ms, 1x80"
    scenario: serial_10ms_1x80
    ramp-up: 1s
    hold-for: 30s
    sequential: true
  - concurrency: 10
    name: "parallel conc=10, 10ms, 4x80"
    scenario: parallel_10ms_4x80
    ramp-up: 1s
    hold-for: 30s
    sequential: true
  - concurrency: 100
    name: "serial conc=100, 10ms, 1x80"
    scenario: serial_10ms_1x80
    ramp-up: 1s
    hold-for: 30s
    sequential: true
  - concurrency: 100
    name: "parallel conc=100, 10ms, 4x80"
    scenario: parallel_10ms_4x80
    ramp-up: 5s
    hold-for: 30s
    sequential: true

scenarios:
  serial_10ms_1x80:
    requests:
      - url: http://host.docker.internal:8080/benchmark?count=80&durationMs=10&parallelism=1
        method: GET
  parallel_10ms_4x80:
    requests:
      - url: http://host.docker.internal:8080/benchmark?count=80&durationMs=10&parallelism=4
        method: GET


#settings:
#  artifacts-dir: /output

reporting:
  - module: console
  - module: final-stats
    summary: true
#  - module: junit-xml
#    filename: /output/results.xml

monitoring:
  - module: local
    cpu: true
    memory: true